## Plan Result (test_frontendappgateway)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.frontendappgateway.azurerm_public_ip.app_gw[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id                  = (known after apply)
      + log_category_groups = (known after apply)
      + log_category_types  = (known after apply)
      + logs                = (known after apply)
      + metrics             = (known after apply)
      + resource_id         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw"
    }

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw"
        name                              = "cft-aks-fe-00-perftest-agw"
      ~ tags                              = {
            "application"  = "core"
          + "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (7 unchanged attributes hidden)

        # (218 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-perftest-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_public_ip.app_gw[0] will be updated in-place
  ~ resource "azurerm_public_ip" "app_gw" {
        id                      = "/subscriptions/8a07fdcd-6abd-48b3-ad88-ff737a4b9e3c/resourceGroups/cft-perftest-network-rg/providers/Microsoft.Network/publicIPAddresses/cft-aks-fe-appgw-perftest-pip"
        name                    = "cft-aks-fe-appgw-perftest-pip"
      ~ tags                    = {
            "application"  = "core"
          + "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "testing"
        }
        # (11 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1677,"Program":"tfcmt","SHA1":"","Target":"test_frontendappgateway","Vars":{}} -->